# Data Preprocessing

## import the libraries

In [ ]:
!uv add numpy

96422.12s - pydevd: Sending message related to process being replaced timed-out after 5 seconds

Resolved 63 packages in 1ms
Audited 52 packages in 0.01ms

In [1]:
import numpy as np #package for scintific calculations
import pandas as pd # dataframes
import matplotlib.pyplot as plt # visualization
import seaborn as sns # better visuals

## import the dataset 
# Heade1

In [2]:
df_=pd.read_csv('data.csv')
df_.shape

(1000, 8)

In [3]:
df=pd.read_csv('data_with_faults.csv')
df.shape

(1050, 8)

In [7]:
df.count()

gender                         862
race_ethnicity                 848
parental_level_of_education    857
lunch                          865
test_preparation_course        855
math_score                     862
reading_score                  871
writing_score                  874
dtype: int64

In [8]:
df.describe()

       math_score  reading_score  writing_score
count  862.000000     871.000000     874.000000
mean    66.059165      68.648680      67.770023
std     16.348199      15.787835      16.151232
min      0.000000       0.000000       0.000000
25%     57.000000      59.000000      57.000000
50%     67.000000      70.000000      69.000000
75%     77.000000      79.000000      78.000000
max    100.000000     100.000000     100.000000

In [5]:
df.tail(5)

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
1045,female,group B,NaN,standard,none,NaN,63.0,65.0
1046,female,group A,master's degree,free/reduced,none,50.0,67.0,73.0
1047,male,group D,bachelor's degree,free/reduced,NaN,74.0,NaN,75.0
1048,female,NaN,some high school,NaN,none,82.0,NaN,80.0
1049,NaN,group E,bachelor's degree,standard,none,82.0,NaN,62.0

## Data Exploration

In [9]:
# delete duplicate rows

In [7]:
df.duplicated().sum()

np.int64(48)

In [21]:
df.drop_duplicates(inplace=True)
df.shape
# 4 duplicates removed

(1002, 8)

In [12]:
df.reset_index(inplace=True)
df.drop('index',axis=1,inplace=True)
df

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,NaN,NaN,standard,NaN,72.0,72.0,NaN
1,NaN,group C,some college,standard,NaN,69.0,NaN,88.0
2,female,group B,master's degree,standard,NaN,90.0,95.0,93.0
3,male,group A,associate's degree,free/reduced,none,47.0,NaN,44.0
4,NaN,NaN,some college,standard,none,76.0,NaN,NaN
...,...,...,...,...,...,...,...,...
997,female,group D,some college,free/reduced,none,77.0,86.0,86.0
998,male,group D,high school,standard,none,NaN,73.0,68.0
999,NaN,group C,high school,standard,none,100.0,56.0,51.0
1000,female,NaN,some college,free/reduced,completed,48.0,56.0,58.0
1001,female,group B,associate's degree,standard,none,NaN,100.0,78.0

In [13]:
df.head(5)

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,NaN,NaN,standard,NaN,72.0,72.0,NaN
1,NaN,group C,some college,standard,NaN,69.0,NaN,88.0
2,female,group B,master's degree,standard,NaN,90.0,95.0,93.0
3,male,group A,associate's degree,free/reduced,none,47.0,NaN,44.0
4,NaN,NaN,some college,standard,none,76.0,NaN,NaN

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1002 entries, 0 to 1001
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       819 non-null    object
 1   race_ethnicity               811 non-null    object
 2   parental_level_of_education  819 non-null    object
 3   lunch                        826 non-null    object
 4   test_preparation_course      810 non-null    object
 5   math_score                   822 non-null    float64
 6   reading_score                834 non-null    float64
 7   writing_score                837 non-null    float64
dtypes: float64(3), object(5)
memory usage: 62.8+ KB

In [4]:
df.isnull().sum()

gender                         188
race_ethnicity                 202
parental_level_of_education    193
lunch                          185
test_preparation_course        195
math_score                     188
reading_score                  179
writing_score                  176
dtype: int64

In [5]:
#Check if there is any null values
df.isna().sum()

gender                         188
race_ethnicity                 202
parental_level_of_education    193
lunch                          185
test_preparation_course        195
math_score                     188
reading_score                  179
writing_score                  176
dtype: int64

In [ ]:
import pandas as pd

# Sample dataset
data = pd.read_csv('data_with_faults.csv')
df = pd.DataFrame(data)
print(type(df))

# original data
print("Original Data:")
print(df)

# Remove duplicates
df = df.drop_duplicates()

# Handle missing values
df['math_score'] = df['math_score'].fillna(df['math_score'].mean())  # Replace with mean math_score
df['writing_score'] = df['writing_score'].fillna(df['writing_score'].median())  # Replace with median writing_score
df['parental_level_of_education'] = df['parental_level_of_education'].fillna('some college')  # Replace None with 'No Activity'

# cleaned data
print("\nCleaned Data:")
print(df)

In [23]:
df.columns

Index(['gender', 'race_ethnicity', 'parental_level_of_education', 'lunch',
       'test_preparation_course', 'math_score', 'reading_score',
       'writing_score'],
      dtype='object')

In [17]:
#Unique value in each columns

In [24]:
unique=df.nunique()
unique

gender                          2
race_ethnicity                  5
parental_level_of_education     6
lunch                           2
test_preparation_course         2
math_score                     82
reading_score                  75
writing_score                  78
dtype: int64

In [19]:
df['Company'].unique()

KeyError: 'Company'

In [ ]:
# observations: here 'Infosys' & 'Infosys Pvt Lmt','TCS' & 'Tata Consultancy Services','CTS' & 'Congnizant'('Cognizant') 
# are same.
# Treat them appropriately.

In [ ]:
df.describe()

              Age       Salary      Gender
count  127.000000   121.000000  144.000000
mean    30.527559  5283.471074    0.222222
std     11.114717  2585.373600    0.417191
min      0.000000  1089.000000    0.000000
25%     22.000000  3030.000000    0.000000
50%     33.000000  5000.000000    0.000000
75%     37.500000  8000.000000    0.000000
max     54.000000  9876.000000    1.000000

## Data Cleaning

In [ ]:
#Outlier detection
#using IQR
#Chances of getting outliers are only in the 'Age' and 'Salary' columns.

*************************************************************************************************************************

*************************************************************************************************************************